#날짜 : 2022/04/18
#이름 : 김철학
#내용 : 자료형 실습하기 교재 p41

#숫자형(정수, 실수)
num1 <- 1
num2 <- -2
num3 <- 3.14
num1;num2;num3

#논리형
bool1 <- TRUE
bool2 <- FALSE
bool1
bool2

#문자형(문자, 문자열)
str1 <- 'Hello'
str2 <- '안녕'
str1
str2

#특수형
var1 <- NULL # 값이 없음을 의미하는 값, 초기값
var2 <- NA   # 결측값, Not Available
var3 <- NaN  # 수학적으로 정의가 불가능 값, Not a Number
var1
var2
var3

####################################################
#교재 p42 실습 - 스칼라 변수 사용 예

#교재 p43 실습 - 자료형 확인
#교재 p43 실습 - 문자 원소를 숫자 원소로 형 변환하기기

#교재 p44 실습 - 스칼라 변수의 자료형과 자료구조 확인

#교재 p45 실습 - 문자벡터와 그래프 생성
#교재 p45 실습 - as.factor() 함수를 이용하여 요인형 변환

#교재 p46 실습 - Factor형 변수로 차트 그리기














