#날짜 : 2021/01/20
#이름 : 김철학
#내용 : Ch05.데이터 시각화 - 상자그래프 교재 p148

################
#박스상자 기본
################
cars
str(cars)
View(cars)

dist <- cars[,2]
dist

boxplot(dist)
boxplot.stats(dist)

#######################################
#박스상자를 이용하여 자동차 데이터 분석
#######################################




#######################################
#박스상자를 이용하여 붓꽃 데이터 분석
#######################################

#######################################
#월별 기온 변화 다중 박스상자 실습
#######################################
