#날짜 : 2021/01/21
#이름 : 김철학
#내용 : Ch11.기술통계분석 - 척도별 기술통계량 구하기 교재 p368

##################
#교재예제 실습하기
##################

#교재 p368 실습 - 전체 데이터 셋의 특성 보기

#교재 p370 실습 - 성별(gender) 변수의 기술 통계량과 빈도수 구하기
#교재 p370 실습 - 이상치(outlier) 제거
#교재 p370 실습 - 구성 비율 계산

#교재 p371 실습 - 학력 수준 변수를 대상으로 구성 비율 구하기
#교재 p371 실습 - 학력 수준 변수의 빈도수 시각화 하기

#교재 p372 실습 - 만족도 변수를 대상으로 요약통계량 구하기
#교재 p372 실습 - 등간척도 빈도분석

#교재 p373 실습 - 등간척도 시각화하기

#교재 p374 실습 - 생활비 변수 대상 요약 통계량 구하기
#교재 p374 실습 - 데이터 정제(결측치 제거)
#교재 p374 실습 - 생활비 변수를 대상으로 대표값 구하기

#교재 p376 실습 - 생활비 변수의 최빈수 구하기

#교재 p377 실습 - 생활비 변수를 대상으로 산포도 구하기

#교재 p379 실습 - 생활비 변수의 빈도분석과 시각화하기

#교재 p381 실습 - 패키지를 이용한 비대칭도 구하기

#교재 p382 실습 - 히스토그램과 정규분포 곡선 그리기
#교재 p382 실습 - attach()/detach() 함수로 기술통계량 구하기

#교재 p383 실습 - NA가 있는 경우 제거한 뒤에 기술통계량 구하기기








